{
  "backend/main.mo": "Main Motoko actor for the TAPI OK backend, defining data types (Product, Order, Cart, UserAccount, etc.) and managing state maps for products, orders, contacts, feedback, and checkout sessions, with Stripe configuration and role-based access control mixins.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor type shapes to handle canister state upgrades, adding new fields like userAccounts, feedbacks, and generatedContent to the existing data structures.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (logo resize, username/password auth, feedback backend wiring) to their relevant source files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary document describing the purpose and key details of each frontend source file in the project.",
  "frontend/index.css": "Global CSS file defining OKLCH-based design tokens for light and dark themes, including background, foreground, border, chart, and sidebar color variables using Tailwind's @layer base.",
  "frontend/index.html": "HTML entry point for the TAPI OK React app, setting the page title and mounting the React app into a root div via the main.tsx module script.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes, wraps the app in QueryClient, ThemeProvider, InternalAuthProvider, AuthModalProvider, and LanguageProvider, and initializes the theme from localStorage on mount.",
  "frontend/src/components/AuthModal.tsx": "A modal dialog component with login and signup tabs, including form state management, validation (email, username, password strength), and integration with internal auth context.",
  "frontend/src/components/CartDrawer.tsx": "A mobile slide-up drawer showing cart items with quantity controls, image error handling, and a floating trigger button with item count badge.",
  "frontend/src/components/Footer.tsx": "Site footer with brand description, quick navigation links, and social media icons (Facebook, Instagram, X), plus a copyright line with a Caffeine.ai attribution link.",
  "frontend/src/components/Header.tsx": "Sticky site header with navigation links, cart icon with count, theme toggle, language switcher, and user auth controls (login/logout/profile dropdown).",
  "frontend/src/components/HeroBackground.tsx": "An animated canvas component that renders a warm golden gradient background with a floating particle system and connecting lines between nearby particles.",
  "frontend/src/components/LanguageSwitcher.tsx": "A dropdown menu component for switching between English, Hindi, Tamil, and Malayalam using the LanguageContext.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper that composes Header, Footer, ProfileSetupModal, and renders child routes via Outlet or explicit children.",
  "frontend/src/components/LoadingSpinner.tsx": "A simple loading spinner component that displays a spinning chips image in small, default, or large sizes.",
  "frontend/src/components/ProductSlider.tsx": "A React component that displays an animated image slider for TAPI OK Tapioca Chips products, with entry pop-up animation, auto-play, and manual navigation controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated Internet Identity users to create a profile by entering their name and email, then saves it via a mutation hook.",
  "frontend/src/components/StripeSetupModal.tsx": "An empty file with no content or exports.",
  "frontend/src/components/UserProfileDisplay.tsx": "A small presentational component that renders a user's avatar (with first-letter fallback) and optionally their display name.",
  "frontend/src/contexts/AuthModalContext.tsx": "Provides a React context and hook for controlling the open/closed state of an authentication modal globally.",
  "frontend/src/contexts/InternalAuthContext.tsx": "Provides a username/password-based internal authentication context that stores hashed credentials in localStorage and registers accounts with the backend actor.",
  "frontend/src/contexts/LanguageContext.tsx": "Provides a React context for managing the app's UI language (English or other), persisting the selection to localStorage and exposing a translations object.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, exposing login/logout functions, identity state, and login status through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data including products, user profiles, contact/feedback submissions, and admin checks using the actor pattern.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind CSS, defines OKLCH-based CSS custom properties for light/dark themes, and declares entrance animation keyframes and utility classes.",
  "frontend/src/lib/productData.ts": "Contains static product data for tapioca chip flavors (Cheesy, Salty, etc.) with multilingual translations (English, Hindi, Tamil, Malayalam) including names, descriptions, and ingredients.",
  "frontend/src/lib/productHelpers.ts": "Provides helper functions to extract localized product name, description, and ingredients from a Product object based on the selected Language.",
  "frontend/src/lib/translations.ts": "Defines the Translations interface and a full translations record for four languages (en, hi, ta, ml) covering all UI strings used across the application.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that checks caller admin status and renders placeholder cards for Products, Orders, and Contact Submissions management, or shows an access-denied message.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with quantity controls and removal options, or an empty-cart state with a link to continue shopping, using localized text and product helpers.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with three forms (general contact, idea submission, and feedback) that submit data via React Query mutations and display toast notifications. Uses language context for i18n and auth context to associate feedback with logged-in users.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring an animated hero section with a tagline, CTA buttons navigating to products/contact, and a product slider component. Animations trigger once on mount using a state flag.",
  "frontend/src/pages/LoginPage.tsx": "Empty file with no content.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Static page displayed after a failed payment, showing an error icon and links to retry via the products page or contact support.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Page shown after a successful payment that clears the cart on mount and displays a confirmation message with links to continue shopping or return home.",
  "frontend/src/pages/ProductDetailPage.tsx": "Detail page for a single product loaded from static data by ID, supporting quantity selection, add-to-cart, and localized name/description/ingredients display.",
  "frontend/src/pages/ProductsPage.tsx": "Product listing page that renders all static products as cards with localized names, vegan/gluten-free badges, add-to-cart buttons, and navigation to individual product detail pages.",
  "frontend/src/store/cartStore.ts": "Zustand store with persistence for the shopping cart, providing actions to add, remove, update quantity, clear items, and calculate total price in cents.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom colors, typography, border radius, animations, and font families (Inter/Poppins) for the frontend.",
  "project_state.json": "Project state tracking file that records existing features, pending feature requests, architectural notes, and known issues for the TAPI OK ICP/Motoko website project."
}