{
  "backend/main.mo": "Main Motoko actor defining the backend API with product catalog, contact/idea submissions, orders, user profiles, shopping carts, language preferences, checkout sessions, and Stripe integration with access control.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: replacing the header logo with TAPI OK brand image, setting permanent red header background (#D32F2F), updating theme brand color to red, and replacing home page chip image with brand logo.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, pages, hooks, stores, and configuration files with details about TAPI OK branding, #D32F2F color scheme, animations, and multi-language support.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark themes with custom CSS layer definitions for base styles.",
  "frontend/index.html": "HTML entry point with viewport meta tag, page title 'TAPI OK - Tapioca Chips Online Store', root div, and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with all application routes, QueryClient, ThemeProvider with manual initialization, LanguageProvider, InternalAuthProvider, AuthModalProvider, AuthModal, and Toaster components.",
  "frontend/src/components/AuthModal.tsx": "Authentication modal dialog with tabbed login/signup forms, email/password validation, password strength indicator, visibility toggles, error handling, and integration with InternalAuthContext and toast notifications.",
  "frontend/src/components/CartDrawer.tsx": "Mobile-optimized drawer component displaying shopping cart items with quantity controls, image fallback handling, and animations. Includes empty state, item management (add/remove/update), and uses Zustand cart store with internationalization support.",
  "frontend/src/components/Footer.tsx": "Footer component with three-column layout showing brand info, quick navigation links, and social media icons. Includes Caffeine.ai attribution link and dynamic copyright year.",
  "frontend/src/components/Header.tsx": "Sticky header with navigation, cart icon with item count badge, theme toggle, language switcher, and user authentication controls. Features responsive mobile menu and integrates with internal auth context.",
  "frontend/src/components/HeroBackground.tsx": "Canvas-based animated background with particle system and gradient effects. Creates floating organic elements with golden/amber hues and smooth color transitions for hero sections.",
  "frontend/src/components/LanguageSwitcher.tsx": "Dropdown menu component for switching between four languages (English, Hindi, Tamil, Malayalam). Shows native language names and marks currently selected language.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper component that renders Header, Footer, ProfileSetupModal, and outlet for nested routes. Provides consistent page structure across the application.",
  "frontend/src/components/LoadingSpinner.tsx": "Simple loading indicator component displaying an animated spinning chips image with configurable size options (small, default, large).",
  "frontend/src/components/ProductSlider.tsx": "Auto-playing image carousel showcasing three product flavors with navigation controls, dot indicators, and entry animations. Features pop-up animation on mount followed by automatic sliding.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name and email, then saves the profile using the backend actor.",
  "frontend/src/components/StripeSetupModal.tsx": "Empty file with no content.",
  "frontend/src/components/UserProfileDisplay.tsx": "Displays a user avatar with their first initial and optionally their name below it, with hover animations.",
  "frontend/src/contexts/AuthModalContext.tsx": "React context that manages the open/close state of an authentication modal, providing openModal and closeModal functions.",
  "frontend/src/contexts/InternalAuthContext.tsx": "Provides internal authentication using localStorage for credentials, with login/signup/logout functions that sync with the backend actor for user profiles.",
  "frontend/src/contexts/LanguageContext.tsx": "React context that manages the current language selection (stored in localStorage) and provides translations via the `t` object.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and caches a backend actor based on Internet Identity authentication state, initializing access control with an admin token from URL params.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functions, identity state, and login status tracking using @dfinity/auth-client.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching products, user profiles, contact submissions, admin status, and submitting contact/idea forms via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with OKLCH color system for light/dark themes, brand colors, and custom entrance animations (fadeInUp, slideInLeft, etc.) with motion preference support.",
  "frontend/src/lib/productData.ts": "Defines static product data for three tapioca chip flavors (Cheesy, Salty, and one more) with multilingual translations (English, Hindi, Tamil, Malayalam) including names, descriptions, ingredients, and dietary information.",
  "frontend/src/lib/productHelpers.ts": "Provides helper functions to extract localized product names, descriptions, and ingredients from Product objects based on the selected language.",
  "frontend/src/lib/translations.ts": "Defines the Language type and comprehensive translation strings for the entire application across four languages (English, Hindi, Tamil, Malayalam), covering navigation, product details, cart, contact forms, and UI messages.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that checks user permissions and displays placeholder cards for product, order, and contact submission management features.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page displaying cart items with quantity controls, remove functionality, order summary with pricing, and empty cart state with navigation to products.",
  "frontend/src/pages/ContactPage.tsx": "Contact page with two forms: a contact form for customer inquiries and an idea suggestion box, both with validation and toast notifications for submission feedback.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring an animated hero section with background effects, product highlights, call-to-action buttons, and a product slider showcasing tapioca chip offerings.",
  "frontend/src/pages/LoginPage.tsx": "Login page component (content truncated in provided source).",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment failure page with a red error icon, message, and buttons to retry payment or contact support.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Displays a payment success page with a green checkmark icon, clears the cart on mount, and provides navigation to continue shopping or return home.",
  "frontend/src/pages/ProductDetailPage.tsx": "Shows detailed product information including image, description, ingredients, dietary badges, and quantity selector with add-to-cart functionality. Supports multi-language display and handles product not found states.",
  "frontend/src/pages/ProductsPage.tsx": "Displays a grid of all available products with cards showing images, names, descriptions, dietary badges, and add-to-cart buttons. Supports multi-language product information and navigation to product detail pages.",
  "frontend/src/store/cartStore.ts": "Zustand store managing shopping cart state with persistence, including add/remove/update item operations, quantity management, cart clearing, and total price calculation.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom theme colors (brand, golden), animations (float, fade-in, slide-in), container settings, and extended design tokens for the application.",
  "project_state.json": "Project state file for TAPI OK brand website tracking features for logo replacement, permanent #D32F2F red header color, and brand theme updates. Contains four existing features and four pending feature requests related to branding and color scheme implementation."
}